app/controllers/edges_controller.rb

SELECT * FROM "edges"
---
  def index
    @edges = Edge.all

SELECT * FROM "edges" WHERE ("edges"."id" = 1)
---
  def show
    @edge = Edge.find(params[:id])

SELECT * FROM "edges" WHERE ("edges"."id" = 1)
---
  def edit
    @edge = Edge.find(params[:id])

INSERT INTO "edges" ("updated_at", "from", "point_id", "to", "direction", "created_at") VALUES('2010-06-12 19:21:17', 'Rose Art Museum, Brandeis University', NULL, 'Sherman Hall, Brandeis University', 'Go straight', '2010-06-12 19:21:17')
---
  def create
    @edge = Edge.new(params[:edge])

    respond_to do |format|
      if @edge.save

SELECT * FROM "edges" WHERE ("edges"."id" = 1)
UPDATE "edges" SET "to_point_id" = 561116994, "updated_at" = '2010-06-14 18:47:19' WHERE "id" = 1
---
  def update
    @edge = Edge.find(params[:id])

    respond_to do |format|
      if @edge.update_attributes(params[:edge])

SELECT * FROM "edges" WHERE ("edges"."id" = 2)
DELETE FROM "edges" WHERE "id" = 2
---
  def destroy
    @edge = Edge.find(params[:id])
    @edge.destroy