app/controllers/home_controller.rb

  def index
    @point_names = []
    @points = Point.all
---
SELECT * FROM "points"