app/controllers/operate_marker_controller.rb

INSERT INTO "points" ("name", "city", "address2", "zip", "lng", "address", "lat", "comment", "state") VALUES(NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create
    # Point is created with the arguments passed in the request and saved to database
    point = Point.new(params[:point])
    point.save

INSERT INTO "paths" ("name", "created_at", "updated_at", "description") VALUES('Dummy Test', '2010-07-06 17:21:52', '2010-07-06 17:21:52', 'hmm')
INSERT INTO "edges" ("position", "point_id", "created_at", "path_id", "updated_at", "endpoint_id", "direction") VALUES(NULL, 1, '2010-07-06 17:21:52', NULL, '2010-07-06 17:21:52', 2, 'Go outside')
UPDATE "edges" SET "updated_at" = '2010-07-06 17:21:52', "path_id" = 1 WHERE "id" = 1
---
  def create_edges

	point_string=  params[:m]["point_ids"]
	edges_string = params[:m]["edge_descriptions"]
	puts point_string
	puts edges_string
	puts edges_string.class
	edges_description = edges_string.split("**,")
	puts edges_description

	#convert string into array of point_ids
	point_ids = point_string.split(",")

	path = Path.new(:name => params[:m]["path_name"], :description => params[:m]["path_description"])
	path.save
	len =  point_ids.length
	edges =[]
	k = 0
	for i in point_ids[0..-2]
	    puts i
		j = i.to_i + 1
		puts i.class

		edge = Edge.new(:point_id => i, :endpoint_id => j, :direction => edges_description[k])
		edge.save
		k += 1
		edges.push(edge)