app/controllers/paths_controller.rb

SELECT * FROM "paths"
---
  def index
    @paths = Path.all

SELECT * FROM "paths" WHERE ("paths"."id" = 2)
---
  def show
    @path = Path.find(params[:id])

SELECT * FROM "paths" WHERE ("paths"."id" = 3)
---
  def edit
    @path = Path.find(params[:id])

SELECT * FROM "paths"
---
  def search_path

	a =  params[:m]

	result = []
	@path = Path.new
	available_paths = @path.search(a["start"],a["finish"])

INSERT INTO "paths" ("name", "created_at", "updated_at", "description") VALUES('test', '2010-06-18 22:04:39', '2010-06-18 22:04:39', NULL)
---
  def create
    @path = Path.new(params[:path])

    respond_to do |format|
      if @path.save

SELECT * FROM "paths" WHERE ("paths"."id" = 5)
UPDATE "paths" SET "updated_at" = '2010-06-20 18:22:35', "name" = 'Charu''s path' WHERE "id" = 5
---
  def update
    @path = Path.find(params[:id])

    respond_to do |format|
      if @path.update_attributes(params[:path])

SELECT * FROM "paths" WHERE ("paths"."id" = 2)
DELETE FROM "paths" WHERE "id" = 2
---
  def destroy
    @path = Path.find(params[:id])
    @path.destroy