app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password", "isadmin") VALUES('ngordon', '21762884600.159323713253576', '2010-07-06 16:03:25', '2010-07-06 16:03:25', 'a9ff96524b86859c9b0238db7af4a4e5587ea2ac', NULL)